app/controllers/users_controller.rb

SELECT profiles.*, NULL::text AS distance, NULL::text AS bearing FROM "profiles" WHERE (false)
---
  def index
    @users = if params[:search]
      Profile.where('LOWER(category) LIKE LOWER(?)', "%#{params[:search]}%")